app/controllers/carts_controller.rb

SELECT carts.*,products.* FROM `carts` JOIN products ON carts.products_id = products.id WHERE `carts`.`users_id` = 1
---
  def index
      @carts =Cart.select('carts.*,products.*').joins("JOIN products ON carts.products_id = products.id").where(users_id:1)

INSERT INTO `carts` (`users_id`, `products_id`, `quantity`, `created_at`, `updated_at`) VALUES (1, 1, 6, '2021-05-10 04:35:06.211134', '2021-05-10 04:35:06.211134')
---
  def create
    if !session[:user_id]
      redirect_to :controller => 'home', :action => 'login' and return
    end
    # :users_id, :products_id, :quantity_id)
    @cart = Cart.new(users_id:1 ,products_id: params[:products_id], quantity:params[:quantity])
    # @cart.save()
    # render :json=>@cart
    respond_to do |format|
      if @cart.save