app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories`
---
  def index
    @categories = Category.all

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
  def show
    @cate = Category.find(params[:id])

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('Protein', '2021-05-10 05:47:12.818143', '2021-05-10 05:47:12.818143')
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
    def set_category
      @category = Category.find(params[:id])