app/controllers/home_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def login_post
        session[:user_id]=User::find(1)

        session[:user_name]= User::find(1).username
        session[:id]= User::find(1).id