app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`name`, `desc`, `category_id`, `price`, `thumbnail`, `created_at`, `updated_at`) VALUES ('Sản phẩm protein', 'miêu tả thêm', 3, 900000, 'https://proteinking.vn/wp-content/uploads/2020/10/Whey-deluxe-1-kg-heavenly-rich-600x600-1.png', '2021-05-10 05:49:14.559108', '2021-05-10 05:49:14.559108')

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `products`.`name` = 'Whey Protein', `products`.`updated_at` = '2021-05-10 02:17:33.796610' WHERE `products`.`id` = 2

    def set_product
      @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1